{
  "backend/main.mo": "Main actor implementing show and schedule management with user profiles, authorization via mixins, and CRUD operations for shows and schedules with admin-only write access.",
  "backend/migration.mo": "Migration module defining type definitions for Show, Schedule, UserProfile, and Actor state with a passthrough migration function.",
  "feature_evidence.json": "Feature evidence report documenting the \"create a new show entry\" feature with high confidence, linking to test REQ-4 and multiple components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration for the Country Channel radio website.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system for light and dark themes, defining design tokens for the application.",
  "frontend/index.html": "HTML entry point for the Country Channel Website with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component managing authentication state, profile setup modal, admin dashboard toggle, and rendering Header, Footer, HomePage or AdminDashboard.",
  "frontend/src/components/admin/AddScheduleDialog.tsx": "Dialog form for creating new show schedules with day of week, start/end time selection (hour/minute dropdowns), and validation. Converts times to BigInt format (HHMM) before submission.",
  "frontend/src/components/admin/AddShowDialog.tsx": "Dialog form for adding new shows with ID, title, description, and image upload. Converts uploaded image files to ExternalBlob with upload progress tracking.",
  "frontend/src/components/admin/EditScheduleDialog.tsx": "Dialog form for editing existing schedules, pre-populating fields from the schedule prop. Converts BigInt time values to/from hour and minute components for display and submission.",
  "frontend/src/components/admin/EditShowDialog.tsx": "Dialog form for editing show details (title, description, optional image replacement). Reuses existing image blob if no new file is uploaded, with progress tracking for new uploads.",
  "frontend/src/components/admin/ScheduleManagement.tsx": "Displays schedules organized by day of week in a grid layout with edit/delete actions. Includes confirmation dialog for deletions and formats BigInt times to 12-hour AM/PM display.",
  "frontend/src/components/admin/ShowManagement.tsx": "Displays a grid of show cards with edit and delete actions, using dialogs for editing and confirmation. Handles show deletion via mutation and displays empty state when no shows exist.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, caffeine.ai attribution link, and Country Channel tagline.",
  "frontend/src/components/Header.tsx": "Sticky header with channel logo, login/logout button, and admin dashboard toggle for authorized users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog requiring first-time users to enter their name before accessing the application, with form validation and submission.",
  "frontend/src/components/RadioBanner.tsx": "Scrolling marquee banner with amber gradient background displaying links to Live365 and GetMeRadio streaming platforms.",
  "frontend/src/components/ScheduleView.tsx": "Weekly schedule grid component displaying shows organized by day of week with formatted time ranges and show titles.",
  "frontend/src/components/ShowCard.tsx": "Displays a show card with image, title, and description. Uses ExternalBlob's getDirectURL() to fetch and display show images with a fallback placeholder.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating actors based on Internet Identity state and initializing access control with admin token. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with delegation origin support.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, shows, and schedules with CRUD operations. Each mutation automatically invalidates relevant query caches.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus a marquee animation utility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for managing shows and schedules, displaying management components and dialogs for adding new shows/schedules.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that displays a hero banner, live radio player, recently played tracks, and tabbed sections for shows and schedules using custom hooks to fetch data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, and custom animations including accordion and marquee effects.",
  "project_state.json": "Project state tracking file containing pending feature requests to add weekend and morning show schedules, along with existing features and architectural notes."
}